[
    {
        "title": "League of Legends Game Length Predictor",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Performed linear regression on League of Legends game data to predict game length based on various in-game statistics.",
        "url": "https://jassyq.github.io/LeagueOfLegends-Data-Report/"
    },
    {
        "title": "San Diego MTS Bus Wait Time Analysis",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Analyzed San Diego MTS bus wait times using historical data to identify patterns and improve scheduling efficiency."
    },
    {
        "title": "Loan Applications",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed a machine learning model to predict loan application outcomes based on applicant data, improving approval accuracy and reducing risk."
    },
    {
        "title": "Language Model",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Created a custom language model using deep learning techniques to generate human-like text, enhancing natural language processing capabilities."
    },
    {
        "title": "Imagine Converter",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed an image-to-text converter that utilizes advanced OCR techniques to extract text from images, facilitating data entry and document digitization."
    },
    {
        "title": "Simple Number Recognizer",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built a simple number recognition system using machine learning algorithms to identify handwritten digits, demonstrating basic image classification techniques."
    },
    {
        "title": "Taylor Swift Song Recommender",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Developed a song recommendation system using collaborative filtering techniques to suggest Taylor Swift songs based on user preferences and listening history."
    },
    {
        "title": "Meoterite Landing Simulator",
        "year": "2023",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Created a simulation of meteorite landings using physics-based modeling to study impact dynamics and predict landing sites, contributing to planetary science research."
    },
    {
        "title": "Boston Bike Route Overview",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Analyzed and visualized bike route data in Boston to identify popular paths and suggest improvements for cycling infrastructure, promoting sustainable transportation.",
        "url": "https://jassyq.github.io/bikers/"
    },
    {
        "title": "Non vero quas aspernatur?",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Amet, rem. Quibusdam placeat, porro aliquid debitis doloribus reprehenderit adipisci, aperiam iusto eaque officiis repellendus. At nam, porro sequi odit sed consequuntur? Eum error quo ea! Unde neque itaque error."
    },
    {
        "title": "Dolor sed ratione odio.",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Suscipit, harum incidunt numquam eius sapiente delectus. Repellendus, similique ab. Natus aspernatur blanditiis, dignissimos ea sint distinctio odit nam ipsa vero quis explicabo porro qui velit commodi, perspiciatis reprehenderit optio."
    },
    {
        "title": "Veniam quibusdam ad iure?",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Voluptate praesentium alias explicabo odio, minus sunt ipsum velit deserunt ipsa suscipit sit minima expedita pariatur fuga facere et mollitia fugit. Quaerat voluptatem quidem impedit aliquam saepe hic rerum aspernatur."
    }
]